In [33]:
import sqlite3
import pandas as pd

# Conectar a la base de datos SQLite
conn = sqlite3.connect('test.db')

# Ejecutar una consulta y cargar los resultados en un DataFrame de pandas
query = "SELECT * FROM employees"
df = pd.read_sql_query(query, conn)

# Mostrar el DataFrame
print(df.shape)
df.head()

(2, 5)

   id full_name   hire_date  number1  number2
0   1  John Doe  2023-01-01      100      200
1   2  Jane Doe  2023-02-01      150      250

In [34]:
# Ejecutar una consulta y cargar los resultados en un DataFrame de pandas
query = "SELECT * FROM jobs"
df = pd.read_sql_query(query, conn)

# Mostrar el DataFrame
print(df.shape)
df.head()

(0, 2)

Empty DataFrame
Columns: [id, position_name]
Index: []

In [35]:
# Ejecutar una consulta y cargar los resultados en un DataFrame de pandas
query = "SELECT * FROM departments"
df = pd.read_sql_query(query, conn)

# Mostrar el DataFrame
print(df.shape)
df.head()

(0, 2)

Empty DataFrame
Columns: [id, name]
Index: []

In [36]:
# Cerrar la conexi√≥n
conn.close()